benchmark testing/output_workloadb_cassandra.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/guava-16.0.1.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/metrics-core-3.1.2.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/home/alec_fei/ycsb-0.17.0/cassandra-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.CassandraCQLClient -p hosts=127.0.0.1 -s -P workloads/workloadb
[OVERALL], RunTime(ms), 25887
[OVERALL], Throughput(ops/sec), 237.57098157376288
[TOTAL_GCS_PS_Scavenge], Count, 8
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 108
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.41719782130026656
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 108
[TOTAL_GC_TIME_%], Time(%), 0.41719782130026656
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2288640.0
[CLEANUP], MinLatency(us), 2287616
[CLEANUP], MaxLatency(us), 2289663
[CLEANUP], 95thPercentileLatency(us), 2289663
[CLEANUP], 99thPercentileLatency(us), 2289663
[INSERT], Operations, 6150
[INSERT], AverageLatency(us), 2838.9146341463415
[INSERT], MinLatency(us), 604
[INSERT], MaxLatency(us), 188543
[INSERT], 95thPercentileLatency(us), 7427
[INSERT], 99thPercentileLatency(us), 23247
[INSERT], Return=OK, 6150
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 3083264.0
[INSERT-FAILED], MinLatency(us), 3082240
[INSERT-FAILED], MaxLatency(us), 3084287
[INSERT-FAILED], 95thPercentileLatency(us), 3084287
[INSERT-FAILED], 99thPercentileLatency(us), 3084287