benchmark testing/output_workloadb_mysql.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/conf:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/commons-collections-3.2.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/commons-lang-2.4.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/commons-pool-1.5.4.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/jdbc-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/home/alec_fei/ycsb-0.17.0/jdbc-binding/lib/serp-1.13.1.jar site.ycsb.Client -load -db site.ycsb.db.JdbcDBClient -P ./jdbc-binding/conf/db.properties -P workloads/workloadb
Adding shard node URL: jdbc:mysql://localhost:3306/BenchTestA
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 279008
[OVERALL], Throughput(ops/sec), 35.84126620025232
[TOTAL_GCS_G1_Young_Generation], Count, 12
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 113
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.040500630806285125
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 113
[TOTAL_GC_TIME_%], Time(%), 0.040500630806285125
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 26440.0
[CLEANUP], MinLatency(us), 26432
[CLEANUP], MaxLatency(us), 26447
[CLEANUP], 95thPercentileLatency(us), 26447
[CLEANUP], 99thPercentileLatency(us), 26447
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 27603.4308
[INSERT], MinLatency(us), 8632
[INSERT], MaxLatency(us), 295935
[INSERT], 95thPercentileLatency(us), 61119
[INSERT], 99thPercentileLatency(us), 98111
[INSERT], Return=OK, 10000