benchmark testing/run_workloada_hbase.txt
/usr/bin/java  -classpath /home/alec_fei/ycsb-0.17.0/conf:/home/alec_fei/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/alec_fei/ycsb-0.17.0/lib/core-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/alec_fei/ycsb-0.17.0/lib/mysql-connector-j-8.0.32.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/alec_fei/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.hbase20.HBaseClient20 -p table=usertable -p columnfamily=family -s -P workloads/workloada
[OVERALL], RunTime(ms), 85564
[OVERALL], Throughput(ops/sec), 116.87158150624094
[TOTAL_GCS_PS_Scavenge], Count, 9
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 236
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2758169323547286
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 102
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.11920901313636575
[TOTAL_GCs], Count, 10
[TOTAL_GC_TIME], Time(ms), 338
[TOTAL_GC_TIME_%], Time(%), 0.39502594549109443
[READ], Operations, 4046
[READ], AverageLatency(us), 9656.532130499258
[READ], MinLatency(us), 658
[READ], MaxLatency(us), 19759103
[READ], 95thPercentileLatency(us), 16511
[READ], 99thPercentileLatency(us), 57567
[READ], Return=OK, 4046
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 45107.5
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 90239
[CLEANUP], 95thPercentileLatency(us), 90239
[CLEANUP], 99thPercentileLatency(us), 90239
[INSERT], Operations, 4955
[INSERT], AverageLatency(us), 5422.6187689202825
[INSERT], MinLatency(us), 688
[INSERT], MaxLatency(us), 644095
[INSERT], 95thPercentileLatency(us), 20511
[INSERT], 99thPercentileLatency(us), 56383
[INSERT], Return=OK, 4955
[UPDATE], Operations, 999
[UPDATE], AverageLatency(us), 6452.424424424425
[UPDATE], MinLatency(us), 704
[UPDATE], MaxLatency(us), 779775
[UPDATE], 95thPercentileLatency(us), 19359
[UPDATE], 99thPercentileLatency(us), 76671
[UPDATE], Return=OK, 999